In [15]:
import pandas as pd

In [16]:
employee= pd.DataFrame({
    "ID": [1,2,3,4],
    "Name":["Daniel","David","Carlos","Maria"]
})
projects= pd.DataFrame({
    "ID": [1,2,3],
    "Project":["Análisis","DesarrolloW","DesarrolloM"]
})
print(employee)
print(projects)

   ID    Name
0   1  Daniel
1   2   David
2   3  Carlos
3   4   Maria
   ID      Project
0   1     Análisis
1   2  DesarrolloW
2   3  DesarrolloM

In [17]:
merged= pd.merge(employee,projects,on="ID")
merged

   ID    Name      Project
0   1  Daniel     Análisis
1   2   David  DesarrolloW
2   3  Carlos  DesarrolloM

In [18]:
clientes= pd.DataFrame({
    "ID": [1,2,3,4],
    "Name":["Daniel","David","Carlos","Maria"],
    "País":["México","España","Chile","Argentina"]
})
compras= pd.DataFrame({
    "ID": [1,2,5],
    "Producto":["Laptop","Tablet","Celular"],
    "Monto":[1200,500,900]
})
print(clientes)
print(compras)

   ID    Name       País
0   1  Daniel     México
1   2   David     España
2   3  Carlos      Chile
3   4   Maria  Argentina
   ID Producto  Monto
0   1   Laptop   1200
1   2   Tablet    500
2   5  Celular    900

In [ ]:
# Sólo toma los ID que ambos DF tengan
# Si no pones un how, por defecto lo hará con inner
innered=pd.merge(clientes, compras, on="ID",how="inner")
print("INNER JOIN:")
innered

   ID    Name    País Producto  Monto
0   1  Daniel  México   Laptop   1200
1   2   David  España   Tablet    500

In [ ]:
#Prioriza el ID del DF de la izquierda, o el primer DF en otras palabras
lefted=pd.merge(clientes, compras, on="ID",how="left")
print("LEFT JOIN:")
lefted

LEFT JOIN:

   ID    Name       País Producto   Monto
0   1  Daniel     México   Laptop  1200.0
1   2   David     España   Tablet   500.0
2   3  Carlos      Chile      NaN     NaN
3   4   Maria  Argentina      NaN     NaN

In [ ]:
#Prioriza el ID del DF de la derecha, o el último DF en otras palabras
righted=pd.merge(clientes, compras, on="ID",how="right")
print("RIGHT JOIN:")
righted

LEFT JOIN:

   ID    Name    País Producto  Monto
0   1  Daniel  México   Laptop   1200
1   2   David  España   Tablet    500
2   5     NaN     NaN  Celular    900

In [25]:
#Pone toda la info disponible
outerred=pd.merge(clientes, compras, on="ID",how="outer")
print("OUTER JOIN:")
outerred

OUTER JOIN:

   ID    Name       País Producto   Monto
0   1  Daniel     México   Laptop  1200.0
1   2   David     España   Tablet   500.0
2   3  Carlos      Chile      NaN     NaN
3   4   Maria  Argentina      NaN     NaN
4   5     NaN        NaN  Celular   900.0